In [1]:
import pandas as pd
import numpy as np

In [2]:
fruits = pd.DataFrame({
    'A': np.random.choice(np.array((1,2,3)), 15),
    'B': np.random.choice(['apple', 'mango', 'banana', 'kiwi', 'pineapple', 'peach'], 15, True),
    'C': np.round(50 + 5*np.random.randn(15), 2)
})

In [3]:
fruits

    A          B      C
0   2  pineapple  44.16
1   3      peach  46.25
2   1      apple  46.58
3   3      mango  46.40
4   2      mango  46.30
5   2     banana  44.05
6   2  pineapple  54.24
7   3      peach  56.65
8   2  pineapple  54.97
9   2      apple  44.64
10  1      apple  54.23
11  3       kiwi  39.65
12  1       kiwi  48.40
13  1       kiwi  57.17
14  1     banana  55.81

In [5]:
fruits.head()

   A          B      C
0  2  pineapple  44.16
1  3      peach  46.25
2  1      apple  46.58
3  3      mango  46.40
4  2      mango  46.30